function newP = TranferCord(O,NORM,P)
%**************************************************************************
%**************************************************************************
%*  时间：2018年1月16日                                                   *
%*  函数目的：将任意多个点的坐标（x，y，z）转变为（X，Y，Z）              *
%*  函数输入：O为xyz坐标系的原点在XYZ坐标系的坐标表示，列向量             *
%*  续上，NORM为xyz坐标系z轴在XYZ坐标系的表示,列向量                      *
%*  续上，P为任意多个点的xyz坐标系中的三维坐标，第一行为x坐标，以此类推   *
%*  函数输出，newP为P所对应的XYZ坐标系的坐标表示                          *
%*  函数描述：O为球面上的点，P为任意点（以O为原点的坐标系oxyz中的坐标）   *
%*  续上，newP为点P在以球心为原点的直角坐标XYZ中的表示                    *
%**************************************************************************
%**************************************************************************
zaxis = NORM.';
zaxisu = zaxis/norm(zaxis);
xy = null(zaxis);
xaxisu = xy(:,1).';
yaxisu = xy(:,2).';
shiftpoint = O;
R = [xaxisu,0;yaxisu,0;zaxisu,0;0,0,0,1];%旋转矩阵
P0 = ones(4,size(P,2));
P0(1:3,:) = P;
T = [1,0,0,shiftpoint(1);0,1,0,shiftpoint(2);0,0,1,shiftpoint(3);0,0,0,1];                                               
newP = (T) *inv(R) * P0;
%保角、保距